:PROPERTIES:
:ID:       abd2d6e9-fe5b-4ba4-8533-0e5a3d174743
:END:
#+TITLE: Golang
#+DESCRIPTION: Go
#+TAGS:

***** Formatting =go list= output

The =go list= output can be formatted using Go Templates for both modules and
packages.

#+begin_src sh :dir (identity go-d2)
go list -m -f '{{.Path}} {{.Version}}' all | head -n11
#+end_src

#+RESULTS:
| oss.terrastruct.com/d2         |                                      |
| cdr.dev/slog                   | v1.4.2-0.20221206192828-e4803b10ae17 |
| cloud.google.com/go            | v0.26.0                              |
| gioui.org                      | v0.2.0                               |
| gioui.org/cpu                  | v0.0.0-20220412190645-f1e9e8c3b1f7   |
| gioui.org/shader               | v1.0.6                               |
| gioui.org/x                    | v0.2.0                               |
| git.sr.ht/~sbinet/gg           | v0.5.0                               |
| github.com/BurntSushi/toml     | v0.3.1                               |
| github.com/PuerkitoBio/goquery | v1.8.1                               |
| github.com/ajstarks/svgo       | v0.0.0-20211024235047-1546f124cd8b   |

From =go help list= output, the =Module= struct is below. There are other
similar structs for Package, Context, etc.

#+begin_src go
type Module struct {
	Path       string        // module path
	Query      string        // version query corresponding to this version
	Version    string        // module version
	Versions   []string      // available module versions
	Replace    *Module       // replaced by this module
	Time       *time.Time    // time version was created
	Update     *Module       // available update (with -u)
	Main       bool          // is this the main module?
	Indirect   bool          // module is only indirectly needed by main module
	Dir        string        // directory holding local copy of files, if any
	GoMod      string        // path to go.mod file describing module, if any
	GoVersion  string        // go version used in module
	Retracted  []string      // retraction information, if any (with -retracted or -u)
	Deprecated string        // deprecation message, if any (with -u)
	Error      *ModuleError  // error loading module
	Origin     any           // provenance of module
	Reuse      bool          // reuse of old module info is safe
}
#+end_src


**** Building d2

This would require =npx= and [[https://github.com/terrastruct/d2/blob/7269d3000feeb8745f3952edb2edea3048742590/make.sh#L19][playwright]] to run the tests. Although it seems
=CGO_ENABLED=0= is set in the [[https://github.com/terrastruct/d2/blob/7269d3000feeb8745f3952edb2edea3048742590/ci/release/_build.sh#L17-L19][d2 ci/release/_build.sh script]], the binary is not
static and, on arch, requires these shared libs:

#+begin_src sh :results output table
ldd `which d2` | tr '	' ' ' |\
    sed -e 's/(.*)//' |\
    sed -e 's/^.*\([-a-zA-Z0-9./]+\)/\1/' |\
    sed -e 's/.=>./ /' |\
    sed -e 's/^ +//'
#+end_src

#+RESULTS:
| linux-vdso.so.1             |                                 |
| libresolv.so.2              | /usr/lib/libresolv.so.2         |
| libc.so.6                   | /usr/lib/libc.so.6              |
| /lib64/ld-linux-x86-64.so.2 | /usr/lib64/ld-linux-x86-64.so.2 |

